#include <iostream>

#include <string>
using namespace std;
int main()
{
 string x, y;
 cout << "Enter the day of week:";
 getline (cin, x);
 cout << "Choose numerator/denomirator:";
 getline (cin, y);
 if (x=="Понедельник" && y=="Числитель")
 cout << "8:20-9:50/nПрактика (1 под.)\n Информаттика и программировани\nПортенко М.С./n12 корп. ауд.418\n\n10:00-11:35\nЛекция\nВведение в специальность\nБулавина Е.В.\n12 корп. ауд. 310\n\n12:05-13:40\nЛекция\nАлгебра и геометрия\nГалаев С.В.\n12 корп. ауд 424";
 else if (x=="Понедельник" && y=="Знаменатель")
 cout << "8:20-9:50/nПрактика (1 под.)\n Информаттика и программирование\nПортенко М.С.\n12 корп. ауд.418\n\n10:00-11:35\nЛекция\nВведение в специальность\nБулавина Е.В./n12 корп. ауд. 310\n\n12:05-13:40\nЛекция\nАлгебра и геометрия\nГалаев С.В.\n12 корп. ауд 424";
 else if (x=="Вторник" && y=="Числитель")
 cout << "8:20-9:50\nПрактика (2 под.)\nИнформаттика и программирование\nКазачкова А.А.\n12 корп. ауд.418\n\n10:00-11:35\nПрактика\nМатематический анализ\nКомиссарова Н.Е.\n12 корп. ауд. 302\n\n12:05-13:40\nПрактика\nРусский язык и культура речи\nШаповалова Н.Г.\n12 корп. ауд 220\n\n13:50-15:25\nПрактика\nИностранный язык";
 else if (x=="Вторник" && y=="Знаменатель")
 cout <<  "8:20-9:50\nПрактика (2 под.)\nИнформаттика и программирование\nКазачкова А.А.\n12 корп. ауд.418\n\n10:00-11:35\nПрактика\nИнформаттика и программирование\nКазачкова А.А.\n12 корп. ауд.313\n\n12:05-13:40\nЛекция\nРусский язык и культура речи\nШаповалова Н.Г.\n12 корп. ауд 220\n\n13:50-15:25\nПрактика\nИностранный язык";
 else if (x=="Среда" && (y=="Числитель" || y=="Знаменатель"))
 cout << "Выходной!!!";
 else if (x=="Четверг" && (y=="Числитель" || y=="Знаменатель"))
 cout << "Выходной!!!";
  else if (x=="Пятница" && (y=="Числитель" || y=="Знаменатель"))
 cout << "8:20-9:50\nЛекция/nИнформаттика и программирование\nФедорова А.Г.\n12 корп. ауд.310\n\n10:00-11:35\nПрактика\nАлгебра и геометрия\nГалаев С.В.\n12 корп. ауд.420\n\n12:05-13:40\nЛекция\nМатематический анализ\nСахно Л.В.\n12 корп. ауд. 424\n\n13:50-15:25\nПрактика\nИностранный язык";
   else if (x=="Суббота" && y=="Числитель")
 cout << "10:00-11:35\nЛекция\nИстория\nЗайцев М.В.\n12 корп. ауд.420\n\n12:05-13:40\nФизическая культура и спорт\nКудрявцева Е.В.\n12 корп. спортзал\n\n13:50-15:25\nПрактика\nМатематический анализ\nКомиссарова Н.Е.\n12 корп. ауд.312";
   else if (x=="Суббота" && y=="Числитель")
 cout << "10:00-11:35\nЛекция\nИстория\nЗайцев М.В.\n12 корп. ауд.420\n\n12:05-13:40\nФизическая культура и спорт\nКудрявцева Е.В.\n12 корп. спортзал\n\n13:50-15:25\nПрактика/nИстория\nЗайцев М.В.\n12 корп. ауд.304";
  return 0;
}
